## Question 1 :  Male and Female count

In [23]:
import pandas as pd

df = pd.read_csv(r"C:\Users\musta\Downloads\StudentsPerformance.csv")
gender_counts = df["gender"].value_counts()
gender_counts

female    518
male      482
Name: gender, dtype: int64

## Question 2 : Parents Education level

In [24]:
parental_counts = df["parental level of education"].value_counts()
print(parental_counts)

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

## Question 3 : Average for math , reading and writing

In [25]:
gen_avg =df[['gender', 'math score', 'reading score', 'writing score']].groupby('gender').mean()
gen_avg

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

In [26]:
test_prep_avg =df[['test preparation course', 'math score', 'reading score', 'writing score']].groupby('test preparation course').mean()
test_prep_avg

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

## Question 4 : Scoring variation for math , reading and writing

In [14]:
gen_variance=df[['gender', 'math score', 'reading score', 'writing score']].groupby('gender').std()
gen_variance

        math score  reading score  writing score
gender
female   16.029928      14.411018      14.844842
male     14.556411      14.149594      14.227225

In [28]:
test_variance=df[['test preparation course', 'math score', 'reading score', 'writing score']].groupby('test preparation course').std()
test_variance

                         math score  reading score  writing score
test preparation course
completed                 14.521847      13.537572      13.236412
none                      15.705689      14.608896      15.041667

## Question 5 : Top 25%

In [19]:
df.nlargest(250,["math score"])

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
515,female,group E,some college,standard,none,100,92,97
516,female,group E,bachelor's degree,standard,none,100,100,100
517,female,group E,associate's degree,standard,none,100,100,100
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
...,...,...,...,...,...,...,...,...
428,female,group D,some college,free/reduced,none,77,86,86
429,female,group E,some high school,standard,none,77,79,80
849,male,group A,bachelor's degree,standard,none,77,67,68
850,male,group C,associate's degree,free/reduced,none,77,67,64
851,male,group D,some college,standard,completed,77,62,62